Revit 2027 API
BuiltInFailures.RebarShapeFailures.ShapeFailure Property
 The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShapeFailure { get; }
Public Shared ReadOnly Property ShapeFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShapeFailure {
	FailureDefinitionId^ get ();
}
static member ShapeFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace